# 4.6 Combining and Exporting Data

# Contents

### 1. Importing Liebaries and Data

### 2. Merging the Instacart Data

# Script

### 1. Importing Liebaries and Data

In [22]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [23]:
path = r'C:\Users\tinar\OneDrive\Dokumente\00 DATA ANALYST Carrer Foundry\04 Immersion Course\4. Python Fundamentals for Data Analysts\2209 Instacart Basket Analysis'

In [24]:
# Import of new data set into Jupyter as a new dataframe:
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', '01 Original Data', 'order_products__prior', 'order_products__prior.csv'), index_col = False)

In [25]:
# Import of df_ords dataset from the previous exercise 
df_ords = pd.read_csv(os.path.join(path, '02 Data', '02 Prepared Data', 'consistent_orders.csv'), index_col = False)

In [26]:
#check the output

In [27]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [28]:
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,prior,1,2,8,11.11484
1,1,1,2398795,1,prior,2,3,7,15.00000
2,2,2,473747,1,prior,3,3,12,21.00000
3,3,3,2254736,1,prior,4,4,7,29.00000
4,4,4,431534,1,prior,5,4,15,28.00000

In [29]:
df_ords_prior.shape

(32434489, 4)

In [30]:
df_ords.shape

(3421083, 9)

In [ ]:
# I am experiencing some issues with the df_ords data set - will try to delete the index colounns as well as the eval set

In [31]:
df_ords = df_ords.drop(columns = ['eval_set','Unnamed: 0.1','Unnamed: 0'])

In [32]:
df_ords

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,11.11484
1,2398795,1,2,3,7,15.00000
2,473747,1,3,3,12,21.00000
3,2254736,1,4,4,7,29.00000
4,431534,1,5,4,15,28.00000
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.00000
3421079,1854736,206209,11,4,10,30.00000
3421080,626363,206209,12,1,12,18.00000
3421081,2977660,206209,13,1,12,7.00000
3421082,272231,206209,14,6,14,30.00000

## 2. Merging Your Instacart Data

In [33]:
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [35]:
df_merged_large.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,11.11484,196,1,0,both
1,2539329,1,1,2,8,11.11484,14084,2,0,both
2,2539329,1,1,2,8,11.11484,12427,3,0,both
3,2539329,1,1,2,8,11.11484,26088,4,0,both
4,2539329,1,1,2,8,11.11484,26405,5,0,both

In [37]:
df_merged_large['_merge'].value_counts() #Using the value_counts() function lets you quickly sum up all the values in the “_merge” column, letting you see instantly whether you have a full match or not.

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [38]:
df_merged_large.to_csv(os.path.join(path, '02 Data','02 Prepared Data','orders_products_combined.csv'))

In [39]:
df_merged_large.to_pickle(os.path.join(path, '02 Data','02 Prepared Data','orders_products_combined.pkl'))